#مكتبة بايثون أساسية للتعامل مع المصفوفات والأعداد بكفاءة عالية.
import numpy as np
#اولوية  للاستدعاء للملفات الموجود مع البرنامج 


# مصفوفة أحادية البعد

x = np.array([1, 2, 3, 4])
print("Array x:", x)

# # مصفوفة ثنائية البعد (2x3)

x1 = np.array([[1, 2],  [3, 4]])
print("Array x1:\n", x1)

x11 = np.array([[1, 2, 3], [3, 4 ,1]])

print("Array x1:\n", x11)

# # # # مصفوفة أصفار
z = np.zeros((3,3))

#2 تمثل عدد الاسطر 
#3 تمثل عدد الاعمدة

print("Zeros:\n", z)


# # # مصفوفة آحاد
z1 = np.ones((3,2))

print("Ones:\n", z1)


# مصفوفة أعداد متتابعة
z2 = np.arange(0, 10, 2) 
 # من 0 إلى 10 بخطوة 2
print("range:", z2)


# # مصفوفة أعداد عشوائية
z3 = np.random.rand(2,3)
  # أعداد عشوائية بين 0 و1
print("Random:\n", z3)
